{
  "order": "Perciformes",
  "family": "Pomacanthidae",
  "genus": "Centropyge",

  "latin": "Centropyge loricula",
  "name": "Flame Angelfish",

  "description": "The flame angelfish's coloration is bright orange-red with a vertical elongated black spot and four or five bars on the sides, the posterior part of the dorsal, and anal fins, with alternating short purple-blue and black bands. Specimens from the Marquesas lack the vertical black bars. Generally, males may be larger and slightly more colored.\nThe life span of the flame angelfish is 5–7 years or more.\nIn captivity, this species feeds on a variety of food including brine shrimp and other meat as well as spirulina, seaweed sheets, and pellets.\nThe flame angelfish is known to be shy upon introduction to an established aquarium, especially smaller specimens; but, within a week, it will gain confidence and is then constantly seen grazing around live rock during the day.\nThe flame angelfish is often considered reef safe. They will adapt to a captive diet quickly which will usually prevent them from consuming soft or stony corals. Individual specimens that do pick at coral or clam mantles are more often than not under fed or under nourished.",

  "range": "It is found in various reefs of Oceania, most common in Marshall, Line, and Cook Islands. The fish is also, although less commonly, found in the Hawai'ian Islands. Particularly, the flame angelfish can be found on the foreslope of coral reefs and clear lagoons.",

  "diet": "In the wild, the flame angelfish has a varied diet consisting of algae and crustaceans. There are occasional specimens that live very long lives in reef aquaria, but the majority of these fish will often die for no apparent reason when they are older. This may be easily explained as many of the Centropyge family are predominately plankton eaters as juveniles and will switch to consuming its natural adult diet once fully grown. Sometimes, all it takes is for an underfed individual to \"test\" a food source. This being the case, angelfish are usually added to a well established tank and feed frozen mysis shrimp, meaty crustaceans such as shrimp and clam.",

  "breeding": "Breeding: The flame angelfish has been known to spawn in captivity. The flame angelfish is haremic in the wild and can be kept in pairs or trios in an extra-large aquarium. The aquarium should contain only one male — the males have more blue on the outer edge of the dorsal and anal fins, and tend to be larger. The fish will spawn toward the end of the day and release pelagic gametes into the water column. Collecting the eggs and raising the larvae is the biggest challenge.",

  "ethics": "",

  "size_min": 6,
  "size_max": 10
}
