{
  "order": "Anguilliformes",
  "family": "Muraenidae",
  "genus": "Echidna",

  "latin": "Echidna nebulosa",
  "name": "Snowflake Moray Eel",

  "description": "The snowflake moray eel is a very commonly kept saltwater eel. They are very hardy and well-suited to life within an aquarium. Up to 36\" in length (while 28\" is more common in captivity), the snowflake moray eel requires an aquarium that is larger than 20 gallons (40–50 gallons when full grown) with a tight-fitting lid, as these eels (and all eels, for that matter) are good at escaping and can fit through surprisingly small holes in aquarium lids. The snowflake eel has been known to live to 4 years and older in captivity. They are carnivores, readily accepting just about any meaty foods, including krill, shrimp, silversides and octopus meat. Unless already acclimated to frozen foods, the moray eel will likely need to be fed with live ghost shrimp when first acquired. Weaning can be accomplished over time. The feeding of freshwater feeder fish (goldfish, rosy reds, etc.) will likely cause liver disease if fed to the eel, so such feeding should be avoided.",

  "range": "",

  "diet": "The snowflake moray eel is not safe to keep with shrimp, crabs or lobsters, since crustaceans are their natural diet. However, they are safe to keep with most other invertebrates, including starfish, anemones and sea urchins. Snowflake morays are reef safe and will not bother corals, though these eels are messy eaters and will require strong filtration and a relatively large protein skimmer for the long-term health of any corals housed in their aquarium. The moray eel will likely consume very small fish; therefore, one should think twice before keeping a snowflake eel with small fish such as damselfish. Compatible tankmates for the snowflake moray eel include other relatively large, aggressive fish, such as lionfish[disambiguation needed], tangs, triggerfish, wrasses, and possibly even other snowflake moray eels if they are both introduced to the tank at the same time.",

  "breeding": "",

  "ethics": "",

  "size_min": null,
  "size_max": 92
}
